import pickle
import copy
import numpy as np
import torch

device = torch.device("cuda" if torch.cuda.is_available() else "cpu")
sys_inform_slots = ['disease']

start_dia_acts = {
    'request': ['disease']
}


# dxy

sym_prio_vec = np.loadtxt('dxy_5_1/sym_prio.txt')

sys_inform_slots_values = ['过敏性鼻炎', '上呼吸道感染', '肺炎', '小儿手足口病', '小儿腹泻']
sys_request_slots = ['咳嗽', '流涕', '过敏', '打喷嚏', '烦躁不安', '喘气', '发烧', '肺部湿啰音', '咳痰', '精神萎靡', '咽部不适', '疱疹', '皮疹', '呕吐', '腹胀', '稀便', '尿少', '厌食', '蛋花样便', '反胃', '鼻塞', '呼吸困难', '抽搐', '盗汗', '揉眼睛', '肺部阴影', '绿便', '揉鼻子', '流口水', '吐泡泡', '腹痛', '流鼻血', '体重减轻', '头痛', '放屁', '肚子咕噜叫', '打嗝', '大便酸臭', '舌苔发白', '淋巴结肿大', '口渴']
sys_request_slots_highfreq = ['流涕', '咳嗽', '鼻塞', '过敏', '揉鼻子', '呼吸困难', '皮疹', '打喷嚏', '咳痰', '抽搐', '发烧', '呕吐', '烦躁不安', '咽部不适', '肺部阴影', '肺部湿啰音', '疱疹', '厌食', '精神萎靡', '流口水', '稀便', '绿便', '蛋花样便', '腹痛']


'''
sys_inform_slots_values = ['小儿腹泻', '小儿手足口病', '过敏性鼻炎', '上呼吸道感染']
sys_request_slots = ['稀便', '厌食', '精神萎靡', '尿少', '发热', '烦躁不安', '疱疹', '咽部不适', '淋巴结肿大', '鼻塞', '咳嗽', '抽动', '皮疹', '流涎', '咳痰', '喷嚏', '流涕', '绿便', '腹痛', '肠鸣音亢进', '呕吐', '盗汗', '呼吸困难', '肛门排气增加', '反胃', '蛋花样便', '腹胀', '过敏', '鼻痒', '呼吸音粗', '头痛', '鼻衄', '眼部发痒', '臭味', '舌苔发白', '口渴', '畏寒', '嗳气', '体重减轻']
sys_request_slots_highfreq = ['稀便', '呕吐', '发热', '烦躁不安', '厌食', '精神萎靡', '绿便', '流涕', '蛋花样便', '腹痛', '皮疹', '疱疹', '咽部不适', '流涎', '咳嗽', '鼻塞', '过敏', '呼吸困难', '喷嚏', '抽动', '咳痰', '鼻痒']
'''


# muzhi


'''
sym_prio_vec = [0.22957746, 0.03521127, 0.42957746, 0.04647887, 0.33661972, 0.04929577, 0.11830986, 0.04929577, 0.06478873, 0.0056338, 
            0.03521127, 0.10704225, 0.19859155, 0.04366197, 0.25070423, 0.06619718, 0.10140845, 0.01971831, 0.05070423, 0.05774648, 0.3056338 , 
            0.01690141, 0.03380282, 0.01830986, 0.03098592, 0.02112676, 0.0084507 , 0.21690141, 0.07605634, 0.01549296, 0.07746479, 0.06901408, 
            0.02957746, 0.11690141, 0.4028169 , 0.01690141, 0.03802817, 0.03943662, 0.0056338 , 0.04507042, 0.01971831, 0.16901408, 0.03661972, 
            0.11549296, 0.01126761, 0.01549296, 0.0084507 , 0.06901408, 0.0084507 , 0.00985915, 0.04366197, 0.02253521, 0.05070423, 0.01267606, 
            0.03380282, 0.01408451, 0.04084507, 0.02394366, 0.03521127, 0.04788732, 0.02394366, 0.01971831, 0.0084507 , 0.01126761, 0.02816901, 0.00985915]


sys_inform_slots_values = ['上呼吸道感染', '小儿支气管炎', '小儿腹泻', '小儿消化不良']
sys_request_slots_highfreq = ['发热', '咳嗽', '鼻流涕', '普通感冒', '中等度热', '有痰', '鼻塞', '低热', '喷嚏', '呕吐', '支气管炎', '痰鸣音', '咳痰', '急性气管支气管炎', '腹泻', '稀便', '水样便', '消化不良', '绿便', '血便', '大便粘液', '屁', '哭闹', '厌食']
sys_request_slots = ['普通感冒', '干咳', '咳嗽', '厌食', '发热', '上呼吸道感染', '中等度热', '出汗', '高热', '头痛', '咽喉不适', '低热', '呕吐', '精神软', '鼻流涕', '喷嚏', '鼻塞', '四肢厥冷', '急性气管支气管炎', '咳痰', '稀便', '食欲不佳', '腹痛', '恶心', '干呕', '肠炎', '过敏', '有痰', '痰鸣音', '扁桃体炎', '退热', '支气管炎', '大便酸臭', '消化不良', '腹泻', '气管炎', '肺炎', '血便', '皮疹', '咽喉炎', '喘息', '水样便', '食欲不振', '绿便', '肛门红肿', '支气管肺炎', '口臭', '哭闹', '湿疹', '鼻炎', '病毒感染', '睡眠障碍', '反复发热', '嗜睡', '便秘', '贫血', '大便粘液', '粗糙呼吸音', '腹胀', '屁', '沙哑', '细菌感染', '尿量减少', '腹部不适', '肠鸣音', '支原体感染']

'''
################################################################################
# Dialog status
################################################################################
FAILED_DIALOG = -1
SUCCESS_DIALOG = 1
NO_OUTCOME_YET = 0

# Rewards
SUCCESS_REWARD = 50
FAILURE_REWARD = 0
PER_TURN_REWARD = 0


################################################################################
#  Diagnosis
################################################################################
NO_DECIDE = 0
NO_MATCH = "no match"
NO_MATCH_BY_RATE = "no match by rate"

################################################################################
#  Special Slot Values
################################################################################
I_AM_NOT_SURE = -1
I_DO_NOT_CARE = "I do not care"
NO_VALUE_MATCH = "NO VALUE MATCHES!!!"

################################################################################
#  Slot Values
################################################################################
TRUE = 1
FALSE = -1
NOT_SURE = -2
NOT_MENTION = 0

################################################################################
#  Constraint Check
################################################################################
CONSTRAINT_CHECK_FAILURE = 0
CONSTRAINT_CHECK_SUCCESS = 1

################################################################################
#  NLG Beam Search
################################################################################
nlg_beam_size = 10

################################################################################
#  run_mode: 0 for dia-act; 1 for NL; 2 for no output
################################################################################
run_mode = 0
auto_suggest = 0

################################################################################
#   A Basic Set of Feasible actions to be Consdered By an RL agent
################################################################################
feasible_actions = [

    ############################################################################
    #   thanks actions
    ############################################################################
    {'diaact':"thanks", 'inform_slots':{}, 'request_slots':{}},
    {'diaact': "inform", 'inform_slots': { 'disease': 'UNK', 'taskcomplete': "PLACEHOLDER"}, 'request_slots': {} }

]
############################################################################
#   Adding the inform actions
############################################################################
for slot_val in sys_inform_slots_values:
    slot = 'disease'
    feasible_actions.append({'diaact':'inform', 'inform_slots':{slot:slot_val, 'taskcomplete': "PLACEHOLDER"}, 'request_slots':{}})
############################################################################
#   Adding the request actions
############################################################################
for slot in sys_request_slots:
    feasible_actions.append({'diaact':'request', 'inform_slots':{}, 'request_slots': {slot: 'UNK'}})

debug_mode = "Xulin"
# debug_mode = "Junfan"
#debug_mode = "Junfan2"
